bench/custom/logs/rfuse/ramdisk/libaio1/rfuse_write_0-1.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=162445: Thu May 30 08:09:31 2024
  write: IOPS=22.8k, BW=88.9MiB/s (93.2MB/s)(32.0GiB/368487msec); 0 zone resets
    slat (usec): min=7, max=152198, avg=1159.61, stdev=1007.83
    clat (nsec): min=298, max=404958, avg=605.53, stdev=255.27
     lat (usec): min=7, max=152201, avg=1160.22, stdev=1007.86
    clat percentiles (nsec):
     |  1.00th=[  482],  5.00th=[  506], 10.00th=[  516], 20.00th=[  524],
     | 30.00th=[  540], 40.00th=[  580], 50.00th=[  612], 60.00th=[  628],
     | 70.00th=[  636], 80.00th=[  652], 90.00th=[  700], 95.00th=[  748],
     | 99.00th=[  876], 99.50th=[  940], 99.90th=[ 1128], 99.95th=[ 1224],
     | 99.99th=[ 3280]
   bw (  KiB/s): min=80401, max=461152, per=100.00%, avg=147815.18, stdev=1653.93, samples=19397
   iops        : min=20097, max=115276, avg=36947.61, stdev=413.51, samples=19397
  lat (nsec)   : 500=3.27%, 750=91.90%, 1000=4.55%
  lat (usec)   : 2=0.26%, 4=0.02%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=0.10%, sys=7.15%, ctx=1154041315, majf=0, minf=443
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=88.9MiB/s (93.2MB/s), 88.9MiB/s-88.9MiB/s (93.2MB/s-93.2MB/s), io=32.0GiB (34.4GB), run=368487-368487msec