bench/custom/logs/rfuse/ramdisk/libaio1/rfuse_write_0-3.log
seq-write-4kb: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.37-28-g3ed8e
Starting 32 processes
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
seq-write-4kb: Laying out IO file (1 file / 1024MiB)
[...]

seq-write-4kb: (groupid=0, jobs=32): err= 0: pid=162712: Thu May 30 08:14:12 2024
  write: IOPS=49.7k, BW=194MiB/s (204MB/s)(32.0GiB/168760msec); 0 zone resets
    slat (usec): min=8, max=92128, avg=502.71, stdev=611.76
    clat (nsec): min=304, max=397497, avg=568.39, stdev=203.02
     lat (usec): min=8, max=92130, avg=503.27, stdev=611.79
    clat percentiles (nsec):
     |  1.00th=[  346],  5.00th=[  366], 10.00th=[  378], 20.00th=[  414],
     | 30.00th=[  524], 40.00th=[  556], 50.00th=[  620], 60.00th=[  636],
     | 70.00th=[  644], 80.00th=[  660], 90.00th=[  700], 95.00th=[  724],
     | 99.00th=[  788], 99.50th=[  828], 99.90th=[  996], 99.95th=[ 1080],
     | 99.99th=[ 3088]
   bw (  KiB/s): min=152301, max=767196, per=100.00%, avg=289598.15, stdev=6315.83, samples=8427
   iops        : min=38074, max=191796, avg=72396.85, stdev=1578.97, samples=8427
  lat (nsec)   : 500=28.15%, 750=69.45%, 1000=2.31%
  lat (usec)   : 2=0.08%, 4=0.02%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=0.22%, sys=14.96%, ctx=1120204904, majf=0, minf=465
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=194MiB/s (204MB/s), 194MiB/s-194MiB/s (204MB/s-204MB/s), io=32.0GiB (34.4GB), run=168760-168760msec